// なげつけるの威力10：きのみ、おこう
var fling10 = [
    'あかいいと', 
    'エレキシード', 
    'おおきなねっこ', 
    'きあいのタスキ', 
    'きあいのハチマキ', 
    'きれいなぬけがら', 
    'グラスシード', 
    'こうかくレンズ', 
    'こうこうのしっぽ', 
    'こだわりハチマキ', 
    'こだわりスカーフ', 
    'こだわりメガネ', 
    'サイコシード', 
    'さらさらいわ', 
    'シルクのスカーフ', 
    'しろいハーブ', 
    'スピードパウダー', 
    'たつじんのおび', 
    'たべのこし', 
    'ちからのハチマキ', 
    'ねらいのまと', 
    'パワフルハーブ', 
    'ひかりのこな', 
    'ふうせん', 
    'フォーカスレンズ', 
    'ミストシード',　
    'メタルパウダー', 
    'メンタルハーブ', 
    'ものしりメガネ', 
    'れいかいのぬの', 
    'レッドカード', 
    'やすらぎのすず', 
    'やわらかいすな'
]

// なげつけるの威力30
var fling30 = [
    'いのちのたま', 
    'おうじゃのしるし', 
    'かいがらのすず', 
    'かえんだま', 
    'かるいし', 
    'きせきのタネ', 
    'きゅうこん', 
    'くろいヘドロ', 
    'くろいメガネ', 
    'くろおび', 
    'こころのしずく', 
    'じしゃく', 
    'しめつけバンド', 
    'じゅうでんち', 
    'しんかいのウロコ', 
    'しんぴのしずく', 
    'するどいキバ', 
    'だっしゅつボタン', 
    'でんきだま', 
    'どくどくだま', 
    'とけないこおり', 
    'のどスプレー', 
    'のろいのおふだ', 
    'ひかりごけ', 
    'ひかりのねんど', 
    'ピントレンズ', 
    'ぼうごパット', 
    'まがったスプーン', 
    'メタルコート', 
    'メトロノーム', 
    'もくたん', 
    'ゆきだま']
    
// なげつけるの威力40
var fling40 = [
    'しんかのきせき', 
    'つめたいいわ', 
    'ラッキーパンチ'
]

// なげつけるの威力50：メモリ
var fling50 = [
    'するどいくちばし', 
    'だっしゅつパック'
]

// なげつけるの威力60
var fling60 = [
    'こんごうだま', 
    'しらたま', 
    'はっきんだま', 
    'あついいわ', 
    'しめったいわ', 
    'グランドコート', 
    'ゴツゴツメット', 
    'ながねぎ', 
    'ばんのうがさ'
]

// なげつけるの威力70：カセット、パワー系
var fling70 = [
    'どくバリ', 
    'りゅうのキバ'
]

// なげつけるの威力80：メガストーン
var fling80 = [
    'あつぞこブーツ', 
    'からぶりほけん', 
    'くっつきバリ', 
    'じゃくてんほけん', 
    'するどいツメ', 
    'せんせいのツメ', 
    'とつげきチョッキ', 
    'ぼうじんゴーグル'
]

// なげつけるの威力90：プレート
var fling90 = [
    'プレート', 
    'しんかいのキバ', 
    'ねばりのかぎづめ', 
    'ふといホネ'
]

// なげつけるの威力100
var fling100 = [
    'かたいいし', 
    'きちょうなホネ', 
    'ルームサービス'
]

// なげつけるの威力130
var fling130 = [
    'くろいてっきゅう'
]