// なげつけるの威力10：きのみ、おこう
const itemList_fling = {
    damage10: [ // きのみ、おこう
        'あかいいと', 
        'エレキシード', 
        'おおきなねっこ', 
        'きあいのタスキ', 
        'きあいのハチマキ', 
        'きれいなぬけがら', 
        'グラスシード', 
        'こうかくレンズ', 
        'こうこうのしっぽ', 
        'こだわりハチマキ', 
        'こだわりスカーフ', 
        'こだわりメガネ', 
        'サイコシード', 
        'さらさらいわ', 
        'シルクのスカーフ', 
        'しろいハーブ', 
        'スピードパウダー', 
        'たつじんのおび', 
        'たべのこし', 
        'ちからのハチマキ', 
        'ねらいのまと', 
        'パワフルハーブ', 
        'ひかりのこな', 
        'ふうせん', 
        'フォーカスレンズ', 
        'ミストシード', 
        'メタルパウダー', 
        'メンタルハーブ', 
        'ものしりメガネ', 
        'れいかいのぬの', 
        'レッドカード', 
        'やすらぎのすず', 
        'やわらかいすな'
    ], 
    damage30: [
        'いのちのたま', 
        'おうじゃのしるし', 
        'かいがらのすず', 
        'かえんだま', 
        'かるいし', 
        'きせきのタネ', 
        'きゅうこん', 
        'くろいヘドロ', 
        'くろいメガネ', 
        'くろおび', 
        'こころのしずく', 
        'じしゃく', 
        'しめつけバンド', 
        'じゅうでんち', 
        'しんかいのウロコ', 
        'しんぴのしずく', 
        'するどいキバ', 
        'だっしゅつボタン', 
        'でんきだま', 
        'どくどくだま', 
        'とけないこおり', 
        'のどスプレー', 
        'のろいのおふだ', 
        'ひかりごけ', 
        'ひかりのねんど', 
        'ピントレンズ', 
        'ぼうごパット', 
        'まがったスプーン', 
        'メタルコート', 
        'メトロノーム', 
        'もくたん', 
        'ゆきだま'
    ], 
    damage40: [
        'しんかのきせき', 
        'つめたいいわ', 
        'ラッキーパンチ'
    ], 
    damage50: [ // メモリ
        'するどいくちばし', 
        'だっしゅつパック'
    ], 
    damage60: [
        'こんごうだま', 
        'しらたま', 
        'はっきんだま', 
        'あついいわ', 
        'しめったいわ', 
        'グランドコート', 
        'ゴツゴツメット', 
        'ながねぎ', 
        'ばんのうがさ'
    ], 
    damage70: [ // カセット、パワー系
        'どくバリ', 
        'りゅうのキバ'
    ], 
    damage80: [ // メガストーン
        'あつぞこブーツ', 
        'からぶりほけん', 
        'くっつきバリ', 
        'じゃくてんほけん', 
        'するどいツメ', 
        'せんせいのツメ', 
        'とつげきチョッキ', 
        'ぼうじんゴーグル'
    ], 
    damage90: [ // プレート
        'しんかいのキバ', 
        'ねばりのかぎづめ', 
        'ふといホネ'
    ], 
    damage100: [
        'かたいいし', 
        'きちょうなホネ', 
        'ルームサービス'
    ], 
    damage130: [
        'くろいてっきゅう'
    ]
}